{"project":"joyent/manatee","branch":"master","id":"I3d2bd9b0912e7a09ce460b0d93abb41d309d87cf","number":"915","subject":"MANATEE-282 streamline \"manatee-adm rebuild\" Reviewed by: Dave Pacheco \u003cdap@joyent.com\u003e Approved by: Dave Pacheco \u003cdap@joyent.com\u003e","owner":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"url":"https://cr.joyent.us/915","commitMessage":"MANATEE-282 streamline \"manatee-adm rebuild\"\nReviewed by: Dave Pacheco \u003cdap@joyent.com\u003e\nApproved by: Dave Pacheco \u003cdap@joyent.com\u003e\n","createdOn":1479379761,"lastUpdated":1480586014,"open":false,"status":"MERGED","comments":[{"timestamp":1479379761,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"Uploaded patch set 1."},{"timestamp":1479379804,"reviewer":{"name":"Joyent Automation","username":"joyent-automation"},"message":"Patch Set 1: CI-Testing+1\n\n\"make check\" passed ok"},{"timestamp":1479381964,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"Patch Set 1:\n\nThis is my first pass at MANATEE-282, where I want `manatee-adm rebuild` to disable sitter for us if required (that is, the node we\u0027re running the command from is a deposed node), and wait until we\u0027ve dropped out of ZK before continuing. Originally, the user would have had to manually disable manatee-sitter and try the command until it stopped warning about the active ZD node. \n\nI\u0027ve performed a number of Manatee rebuilds with this code and I\u0027m happy that the procedure works as intended. There isn\u0027t a test suite for this that I can find, but with my understanding of Manatee and the rebuild procedure I think I\u0027ve accounted for most scenarios. I\u0027m open to suggestions on further testing. \n\nOne specific piece I\u0027m not sure about is L1408, where I\u0027m re-using a function intended to be used in a vasync.pipeline to update the _.activeData list once a second. It works, but given the location that it\u0027s declared (quite clearly within the section that the comment at L68 covers), I\u0027m not sure about using it outside of its originally intended place (i.e. in a pipeline). \n\nLastly, the only intended difference with this change is that we _don\u0027t_ exit with an \"active ZK node\" error if we know we\u0027re deposed. We still warn the user of an active ZK node in the case that this is run on a non-deposed node, which I think is plenty of warning, but I\u0027m open to suggestions."},{"timestamp":1479393133,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"Uploaded patch set 2."},{"timestamp":1479393172,"reviewer":{"name":"Joyent Automation","username":"joyent-automation"},"message":"Patch Set 2: CI-Testing+1\n\n\"make check\" passed ok"},{"timestamp":1479408777,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"Patch Set 2:\n\n(6 comments)\n\nNice.  This is going to be a big improvement for operators.  I have a few comments below."},{"timestamp":1479468752,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"Patch Set 2:\n\n(6 comments)\n\nThis is great feedback, thank you. I\u0027ve replied to your comments, and I\u0027m going to make a start on some of the initial changes."},{"timestamp":1479499332,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"Patch Set 2:\n\n(3 comments)"},{"timestamp":1479740196,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"Uploaded patch set 3."},{"timestamp":1479740213,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"Patch Set 3:\n\n(5 comments)"},{"timestamp":1479740229,"reviewer":{"name":"Joyent Automation","username":"joyent-automation"},"message":"Patch Set 3: CI-Testing+1\n\n\"make check\" passed ok"},{"timestamp":1479757379,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"Patch Set 3:\n\n(5 comments)\n\nThanks for making these changes!"},{"timestamp":1479816897,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"Uploaded patch set 4."},{"timestamp":1479816939,"reviewer":{"name":"Joyent Automation","username":"joyent-automation"},"message":"Patch Set 4: CI-Testing+1\n\n\"make check\" passed ok"},{"timestamp":1479817137,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"Patch Set 4:\n\n(6 comments)\n\nThanks again for the round of feedback. The diff against base is looking quite tidy now, and I think I\u0027ve made updates to address all of your comments, but let me know if I\u0027ve missed anything!"},{"timestamp":1479842878,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"Patch Set 2:\n\n(2 comments)\n\nThanks!  This is looking great.  As you can tell, much of this code is pretty old, and much of it predates more recently-adopted best practices, so there\u0027s a theme here of \"it would be good to improve this, but it\u0027s beyond the scope of this change.\""},{"timestamp":1479842900,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"Patch Set 4: Code-Review+1\n\nSorry, I didn\u0027t mean for my last comment to show up on PS2."},{"timestamp":1480439484,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"Patch Set 4:\n\nThanks for the feedback, Dave. Do you have any concerns regarding integration approval on this one? Would you like me to look for another reviewer?"},{"timestamp":1480447757,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"Patch Set 4:\n\nCool.  It looks to me like the impact is limited to the \"rebuild\" command, and you\u0027ve tested that a bunch.  Does that include on the primary, sync, async, and deposed peers?  Have you also run \"make prepush\" (or run the test suite by hand)?"},{"timestamp":1480499211,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"Patch Set 4:\n\n\u003e It looks to me like the impact is limited to the \"rebuild\" command, and you\u0027ve tested that a bunch. Does that include on the primary, sync, async, and deposed peers?\n\nThat\u0027s the intention here, yes. I\u0027ve tested this a fair amount on my manatee cluster, and I\u0027ve put together a gist of the outputs that can be expected here: https://gist.github.com/chudley/3a70dd46e22834bab1b8e8203103c284. \n\nRunning against my test cluster, `make prepush` and running the test suite by hand shows no failing tests."},{"timestamp":1480520598,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"Patch Set 4: Integration-Approval+1"},{"timestamp":1480585929,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"Uploaded patch set 5: Commit message was updated."},{"timestamp":1480586014,"reviewer":{"name":"Gerrit Code Review","email":"no-reply@cr.joyent.us"},"message":"Change has been successfully merged by Richard Bradley"}],"currentPatchSet":{"number":"5","revision":"3d2bd9b0912e7a09ce460b0d93abb41d309d87cf","parents":["b9bd56a756d42cdc7fc50ff45fe7ab7264421768"],"ref":"refs/changes/15/915/5","uploader":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"createdOn":1480585929,"author":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"isDraft":false,"kind":"NO_CODE_CHANGE","approvals":[{"type":"CI-Testing","description":"CI-Testing","value":"1","grantedOn":1479816939,"by":{"name":"Joyent Automation","username":"joyent-automation"}},{"type":"Code-Review","description":"Code-Review","value":"1","grantedOn":1479842900,"by":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"}},{"type":"Integration-Approval","description":"Integration-Approval","value":"1","grantedOn":1480520598,"by":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"}},{"type":"SUBM","value":"1","grantedOn":1480586014,"by":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"}}],"files":[{"file":"/COMMIT_MSG","type":"ADDED","insertions":9,"deletions":0},{"file":"lib/adm.js","type":"MODIFIED","insertions":93,"deletions":-21}],"sizeInsertions":93,"sizeDeletions":-21},"patchSets":[{"number":"1","revision":"6148f54c73982c04789b3838c6dbcfa7daf2b1b4","parents":["b9bd56a756d42cdc7fc50ff45fe7ab7264421768"],"ref":"refs/changes/15/915/1","uploader":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"createdOn":1479379761,"author":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"isDraft":false,"kind":"REWORK","approvals":[{"type":"CI-Testing","description":"CI-Testing","value":"1","grantedOn":1479379804,"by":{"name":"Joyent Automation","username":"joyent-automation"}}],"files":[{"file":"/COMMIT_MSG","type":"ADDED","insertions":7,"deletions":0},{"file":"lib/adm.js","type":"MODIFIED","insertions":64,"deletions":-12}],"sizeInsertions":64,"sizeDeletions":-12},{"number":"2","revision":"8094b691112a8e7beecb2b4a5a4f7e8f1fc096ea","parents":["b9bd56a756d42cdc7fc50ff45fe7ab7264421768"],"ref":"refs/changes/15/915/2","uploader":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"createdOn":1479393133,"author":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"isDraft":false,"kind":"REWORK","approvals":[{"type":"CI-Testing","description":"CI-Testing","value":"1","grantedOn":1479393172,"by":{"name":"Joyent Automation","username":"joyent-automation"}}],"comments":[{"file":"lib/adm.js","line":1348,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"Is it worth checking (or asserting, if we\u0027re really sure) that this is not a primary?\n\nI\u0027m not sure it ever makes sense to rebuild anything other than a deposed peer, and I\u0027m tempted to suggest that we disallow that entirely.  I expect you\u0027d be better off deploying a new peer instead.  And if it\u0027s a sync, at the very least I think you\u0027d be better off initiating a takeover so that it becomes an async instead.\n\nThat said, it\u0027s probably reasonable to have the ability to rebuild sync and async peers as a tool in the toolbox, particularly if it doesn\u0027t require any additional work to support it.  At the very least I think there ought to be a stern warning that this is not a normal operational event.  That warning could be deferred to a separate ticket, since at the very least we\u0027re going to require that the node no longer be in ZK, and that\u0027s enough to cause any takeover that could happen."},{"file":"lib/adm.js","line":1348,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"The check for a primary node is done at L1308, so by the time this section is reached I\u0027m pretty confident that we\u0027re not a primary. However, I\u0027m not against some additional assertions around this. \n\n\u003e I\u0027m not sure it ever makes sense to rebuild anything other than a deposed peer, and I\u0027m tempted to suggest that we disallow that entirely\n\nI agree. I think if the message at L1351 were changed to reflect this (rather than recommending sitter be disabled) then that might be enough, but I\u0027ll check out a few options. \n\nUltimately there\u0027s nothing stopping users from disabling sitter themselves regardless, but if the message here could specifically make reference to rebuilds of sync or async nodes being abnormal then it might be at least useful to convey this in a message. As it is today, a user might simply follow instructions, not realising this is a sync node."},{"file":"lib/adm.js","line":1348,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"I\u0027ve opened MANATEE-316 for some better messaging here.\n\nI think the check for primary at L1308 is enough of an assertion to meet your concerns. That is, if we *are* a primary node, we would have terminated execution already (L1310). However, let me know if I\u0027m misunderstanding your comment here and I\u0027ll see what I can do.\n\nI have also updated this comment, as a \"non-deposed async\" didn\u0027t really make sense."},{"file":"lib/adm.js","line":1400,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"Is this the first place where we assume that Manatee is deployed inside the same zone as an SMF service called \"manatee-sitter\", or are there other parts of the tool that already assume that?\n\nI would expect that this wouldn\u0027t work if (a) you were running manatee-adm from a different location (which is definitely supported for many subcommands, and I use that a lot) or (b) you were running it by hand in development, not under the manatee-sitter SMF service.  It\u0027s probably not worth trying to make \"rebuild\" work from a different zone, but we probably want to check that we\u0027re running inside the same zone as the one we\u0027re trying to rebuild.\n\nIt would also be nice to deal with the case where someone is running the sitter by hand in development.  (It probably shouldn\u0027t kill their process or anything, but it would be nice if it could detect that something had gone wrong.  Maybe this will already be caught by the timeout below, and the only change would be to update the error message to reference that possibility?)\n\nOne more nit: it would probably be good to use a more complete FMRI (e.g., \"manta/application/manatee-sitter:default\")."},{"file":"lib/adm.js","line":1400,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"\u003e Is this the first place where we assume that Manatee is deployed inside the same zone as an SMF service called \"manatee-sitter\", or are there other parts of the tool that already assume that?\n\nUnfortunately not (see L1457), and I wanted to use a similar mechanism of handling sitter shutdowns as what already exists. \n\n\u003e we probably want to check that we\u0027re running inside the same zone as the one we\u0027re trying to rebuild.\n\nWe do this to an extent in a few places by using the config\u0027s zoneId (see L1309 for an example). If the config has a different zoneId, though, we could have problems. \n\nI think we can definitely do better in terms of informing the user of what node we\u0027re currently working with, though, so I\u0027ll add some messaging around what the rebuild command is planning to do, which will give the user confirmation. \n\n\u003e ... it would be nice if it could detect that something had gone wrong.  Maybe this will already be caught by the timeout below, and the only change would be to update the error message to reference that possibility?\n\nWith my change, I think the error scenario here would be that we\u0027d fail to find the SMF service and exit with an error. I don\u0027t feel like this is clear enough, though, so thanks for pointing it out. \n\nWhat we could do is check for an active node in ZK, then only if we have one attempt to disable sitter. If we fail with something like an svcadm not found error, warn the user that we can\u0027t find the SMF service, and that they\u0027ll have to manually disable the sitter process (whatever it is) and wait themselves (like they do today), then retry. If we do find the service, we can still follow the new pattern of disabling and waiting on behalf of the user. \n\nI would need to do a bit of thinking on that scenario, though, as I\u0027m not sure if there could be a case where sitter is running, but for some reasons we\u0027re not in ZK.\n\n\u003e One more nit: it would probably be good to use a more complete FMRI (e.g., \"manta/application/manatee-sitter:default\").\n\nI like this idea, but I\u0027m not sure about putting this full path in the code. It would be great if the code could determine the FMRI it\u0027s running under, because ultimately we can\u0027t enforce that a user who is deploying Manatee (especially from GitHub, not our images) is going to name their SMF service exactly this way. For example, in my development zones, I made some very minor changes to smf/sitter.xml to reference the correct config locations and imported it. My FMRI is \"svc:/manatee-sitter:default\", so I guess when we build our images we must do some manipulation to the FMRI on import or something. Perhaps we could define this as a configuration variable that rebuild will look for?"},{"file":"lib/adm.js","line":1400,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"Yeah, this seems to be a place where the distinction between the general-purpose GitHub project and our specific deployment breaks down a bit.  Really, we probably want some kind of hook that people can use to disable or enable the sitter.\n\nIn the meantime, a config variable seems reasonable."},{"file":"lib/adm.js","line":1400,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"I think the scenario that makes the most sense here would be to update the code to look for the config variable (and fall back to \"manatee-sitter\"), but not actually update the config in our repository, unless it\u0027s added with the value of \"manatee-sitter\". \n\nThe scenario I\u0027m trying to avoid here is shipping code that uses the complete FMRI, and existing custom deployments (after updating) suddenly complaining about not finding a match. This would at least be true in my development environment, but because we don\u0027t control the complete FMRI in our manifest, it could also be true for other deployments outside of our images. \n\nMultiple matches isn\u0027t such a big deal today as we\u0027ll simply fail to disable sitter if we find multiple matches. With this change, however, we can give some amount of control to the user by allowing them to specify a complete FMRI in the config if required. \n\nDoes that sounds reasonable to you?"},{"file":"lib/adm.js","line":1400,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"Sure, that\u0027s reasonable.  If we\u0027re not going to change the behavior now, feel free to defer that to a future ticket as well."},{"file":"lib/adm.js","line":1400,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"I think I\u0027d like to defer this, so I\u0027ve created MANATEE-317."},{"file":"lib/adm.js","line":1413,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"Is this different from the logic around lines 1320?  Could we commonize this code?"},{"file":"lib/adm.js","line":1413,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"I think we probably could. Reading over this again, I use the term \"index\" to determine if our current zoneId is in the activeData and then record its location, but I never actually use the index value anyway. \n\nThank for pointing this out, I\u0027ll see about breaking this out into a reusable function."},{"file":"lib/adm.js","line":1413,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"Looking into this some more, I think it makes sense for _active to have another step that ensures _.activeZkNode is updated. After all, changing _.activeZkNode is only valid after making sure the _.activeData is fresh, which is done by calling _active."},{"file":"lib/adm.js","line":1413,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"Sorry about this, but it appears my change to _active broke the command `manta-adm zk-active`, where the config isn\u0027t available in this context.\n\nI\u0027ve broken this out into a separate function that can be called in a pipeline after _active is called, and made a slight change to the checkZkActive loop. This fixes the breakage I introduced. \n\nNone of the other pipeline functions appear to make any assertions. I\u0027ve documented the expected parameters for this function, but do you think it\u0027s worth me also adding some assertions to my new function?"},{"file":"lib/adm.js","line":1413,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"I think more assertions (and generally better factoring in this file) would be a great idea, but I don\u0027t think you need to fix it here."},{"file":"lib/adm.js","line":1424,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"The code at 1352 looks like it tries to read the appropriate timeout from the config.  It might be worth doing that here as well."},{"file":"lib/adm.js","line":1424,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"Thanks, I hadn\u0027t considered that. I\u0027ll use that configuration value here."},{"file":"lib/adm.js","line":1424,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"Cool.  As I was thinking about this some more, I think it might be better to save a timestamp (probably with process.hrtime()) at the beginning and use that to determine if we\u0027ve exceeded the timeout.  Trying 60 times with 1 second between tries isn\u0027t quite the same as waiting 60 seconds, especially if the ZK operations are slow for some reason.\n\nAlso, we may want to use 1.5x - 2x the session timeout value.  If the session times out after 60 seconds, and we fail after _trying_ for 60 seconds, we could very well fail spuriously (e.g., because our last try started at 59.9 seconds, the node was still there, and then we gave up because it completed just after the 60-second mark)."},{"file":"lib/adm.js","line":1424,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"Good point. We\u0027d actually be trying 60s + the accumulated time it took for ZK to respond, which could be another couple of seconds in total. While this does work, it\u0027s not very accurate, so I\u0027m happy to improve this.\n\nre: your spurious failure example, I think so long as we compare our start time with a new time that we gather *after* we receive the response from ZK, and we only fail if it\u0027s still active at that point, then I think we\u0027ll cover your example here. I\u0027ve done this in patch set 3, which I think addresses your example, but let me know if I\u0027m misunderstanding here."},{"file":"lib/adm.js","line":1424,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"That assumes that ZooKeeper expires the session in exactly 60.0 seconds.  It could be off-CPU because of CPU saturation, I/O, or the like.  I don\u0027t think it would be unreasonable if it took several seconds more than that."},{"file":"lib/adm.js","line":1424,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"Thanks, I understand now. I\u0027ll go with a 1.5 increase of the value, and make sure this increased time is portrayed in the message we emit."},{"file":"lib/adm.js","line":1426,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"I think it would be good to flesh out this message, and probably the status messages at 1399 and 1406.  Maybe it could say:\n\n\"Disabling manatee-sitter SMF service to ensure that Manatee is not running.\"\n\"Waiting for this Manatee instance\u0027s ZooKeeper session to expire.\"\n\"This Manatee instance has a ZooKeeper session even after 60 seconds.  Aborting operation.\""},{"file":"lib/adm.js","line":1426,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"Great suggestions, thanks. I\u0027ll update these messages."},{"file":"lib/adm.js","line":1426,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"Done"},{"file":"lib/adm.js","line":1433,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"I\u0027m surprised javascriptlint didn\u0027t complain that were sometimes returning a value here and sometimes not.\n\nFor reference: it makes sense to be consistent with the patterns used in this file, so I wouldn\u0027t change anything here, but I think the pattern of \"return cb()\" to invoke the callback and return early is considered deprecated at this point."},{"file":"lib/adm.js","line":1433,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"I\u0027ve always done \"return cb()\" in my code, but I\u0027ve seen a lot of variation in our various projects, so I generally try and fit to the same pattern that I find in the project. \n\nAre you saying that the recommended early callback method is as follows?\n\n    cb();\n    return;"},{"file":"lib/adm.js","line":1433,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"Yes.  The idea is that if the return value of the function is not meaningful, then we probably shouldn\u0027t return a value.  Or, put differently, the use of \"return x\" should imply that something might be looking at the return value of this function."}],"files":[{"file":"/COMMIT_MSG","type":"ADDED","insertions":7,"deletions":0},{"file":"lib/adm.js","type":"MODIFIED","insertions":65,"deletions":-13}],"sizeInsertions":65,"sizeDeletions":-13},{"number":"3","revision":"d1c1e1890048ddc479ecf6568d0466783399b093","parents":["b9bd56a756d42cdc7fc50ff45fe7ab7264421768"],"ref":"refs/changes/15/915/3","uploader":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"createdOn":1479740196,"author":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"isDraft":false,"kind":"REWORK","approvals":[{"type":"CI-Testing","description":"CI-Testing","value":"1","grantedOn":1479740229,"by":{"name":"Joyent Automation","username":"joyent-automation"}}],"comments":[{"file":"lib/adm.js","line":1414,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"This is nitty, but I would change this to \"up to N seconds\".  We\u0027ve had a lot of stuff in the past that actually always waited N seconds (which was silly), and it would be good to avoid that confusion."},{"file":"lib/adm.js","line":1414,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"Thanks for catching this one. I agree, so I\u0027ve updated the message in PS4."},{"file":"lib/adm.js","line":1423,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"For reference, you can give process.hrtime() an hrtime return value as its argument, and it will compute the difference more precisely.  There are also several functions for working with hrtimes in node-jsprim.  This seems fine given that we don\u0027t care about precision more than 1 second, though."},{"file":"lib/adm.js","line":1423,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"Thanks for the heads up. I like that pattern, so I\u0027ve introduced it in PS4."},{"file":"lib/adm.js","line":1435,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"It looks like this is still inconsistent with the return at line 1438.  Does javascriptlint not flag that?"},{"file":"lib/adm.js","line":1435,"reviewer":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"message":"No flags from javascriptlint that I could see, at least using our config. If I run jsl directly with no config I do see that the function doesn\u0027t always return a value in the output. \n\nIn PS4 I\u0027ve changed this to be consistent with the rest of the function/file."},{"file":"lib/adm.js","line":1435,"reviewer":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},"message":"Ah, it looks like that warning was gagged a few years ago in the config file in this repo.  That\u0027s unfortunate, but certainly fixing that is beyond the scope of this change."}],"files":[{"file":"/COMMIT_MSG","type":"ADDED","insertions":7,"deletions":0},{"file":"lib/adm.js","type":"MODIFIED","insertions":75,"deletions":-21}],"sizeInsertions":75,"sizeDeletions":-21},{"number":"4","revision":"76fcc10ae13b65f33edb41492562be2cf49030e4","parents":["b9bd56a756d42cdc7fc50ff45fe7ab7264421768"],"ref":"refs/changes/15/915/4","uploader":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"createdOn":1479816897,"author":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"isDraft":false,"kind":"REWORK","approvals":[{"type":"Code-Review","description":"Code-Review","value":"1","grantedOn":1479842900,"by":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"}},{"type":"Integration-Approval","description":"Integration-Approval","value":"1","grantedOn":1480520598,"by":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"}},{"type":"CI-Testing","description":"CI-Testing","value":"1","grantedOn":1479816939,"by":{"name":"Joyent Automation","username":"joyent-automation"}}],"files":[{"file":"/COMMIT_MSG","type":"ADDED","insertions":7,"deletions":0},{"file":"lib/adm.js","type":"MODIFIED","insertions":93,"deletions":-21}],"sizeInsertions":93,"sizeDeletions":-21},{"number":"5","revision":"3d2bd9b0912e7a09ce460b0d93abb41d309d87cf","parents":["b9bd56a756d42cdc7fc50ff45fe7ab7264421768"],"ref":"refs/changes/15/915/5","uploader":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"createdOn":1480585929,"author":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"},"isDraft":false,"kind":"NO_CODE_CHANGE","approvals":[{"type":"Code-Review","description":"Code-Review","value":"1","grantedOn":1479842900,"by":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"}},{"type":"Integration-Approval","description":"Integration-Approval","value":"1","grantedOn":1480520598,"by":{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"}},{"type":"CI-Testing","description":"CI-Testing","value":"1","grantedOn":1479816939,"by":{"name":"Joyent Automation","username":"joyent-automation"}},{"type":"SUBM","value":"1","grantedOn":1480586014,"by":{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"}}],"files":[{"file":"/COMMIT_MSG","type":"ADDED","insertions":9,"deletions":0},{"file":"lib/adm.js","type":"MODIFIED","insertions":93,"deletions":-21}],"sizeInsertions":93,"sizeDeletions":-21}],"allReviewers":[{"name":"Joyent Automation","username":"joyent-automation"},{"name":"David Pacheco","email":"dap@joyent.com","username":"davepacheco"},{"name":"Richard Bradley","email":"richard.bradley@joyent.com","username":"chudley"}]}